Davidap041/MSP432_Drivers/Texas-MSP432-Drivers/Peripherals_drivers/Drivers_Control.h
/*
 * Drivers_Control.h
 *
 *  Created on: 21 de mar de 2020
 *      Author: davia
 * Biblioteca para auxiliar o uso da SDK com alguns exemplos
 */
#ifndef DRIVERS_CONTROL_H_
#define DRIVERS_CONTROL_H_

//*****************************************************************************
//
//! \addtogroup gpio_api
//! @{
//
//*****************************************************************************

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C" {
#endif

// **************************************************************************************************************************************************************
// Includes necess�rios
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <ti/devices/msp432p4xx/driverlib/driverlib.h> // usar essa defini��o para o CodeComposer
//#include <driverlib.h>                                   // Usar essa defini��o para o Visual Studio

/*
 *******************************************"gpio.h"*************************************************************
 * GPIO_clearInterruptFlag - Limpa Flga de Interrup��o
 * GPIO_disableInterrupt- Desabilita a Interrup��o
 * GPIO_enableInterrupt - Habilita a Interrup��o -
 * GPIO_getEnabledInterruptStatus - Ver o estado de "Habilita��o" da Flag
 * GPIO_getInputPinValue - Ler o valor de Entrada do Pino
 * GPIO_getInterruptStatus - Ler o estado de interrup��o do pino selecionado -
 * GPIO_interruptEdgeSelect - Seleciona a Borda da Interrup�ao do pino -
 * GPIO_registerInterrupt - Seleciona a rotina de Interrup��o da porta que ser� executada  -
 * GPIO_unregisterInterrupt - Desabilita a rotina de interrup��o da porta configurada anteriormente -
 * GPIO_setAsInputPin - Seleciona como pino de Entrada -
 * GPIO_setAsInputPinWithPullDownResistor - Seleciona como pino de entrada e Resistor de Pull Down -
 * GPIO_setAsInputPinWithPullUpResistor - Seleciona como pino de entrada e Resistor de Pull Up -
 * GPIO_setAsOutputPin - Seleciona como pino de Sa�da -
 *** Pinos podem ser para os m�dulos (p�g 35 Tabela 2.8 PxSel) sen�o por default ser�o simplie I/O (GPIO)
 * GPIO_setAsPeripheralModuleFunctionInputPin - Seleciona o m�dulo funcional 1�,2� ou 3� como entrada -
 * GPIO_setAsPeripheralModuleFunctionOutputPin - Seleciona o m�dulo funcional 1�,2� ou 3� como sa�da -
 *** Set Drive Strength to selected port **??** (Procurar no DataSheet)
 * GPIO_setDriveStrengthHigh - drivestrenght to High -
 * GPIO_setDriveStrengthLow - drivestrenght to Low -
 *** Opera��es com a sa�da dos pinos
 * GPIO_setOutputHighOnPin - Seta o valor de sa�da HIGH para o Pino -
 * GPIO_setOutputLowOnPin - Seta o valor de sa�da LOW para o Pino -
 * GPIO_toggleOutputOnPin - Alterna o valor do pino de sa�da -
 */
/*
 *************************"uart.h"*****************************************
 * UART_initModule(uint32_t moduleInstance, const eUSCI_UART_Config *config) - Configura o m�dulo uart -
 * UART_enableModule(uint32_t moduleInstance) - Habilita inicializando o m�dulo uart configurado -
 * UART_disableModule(uint32_t moduleInstance) - Desabilita o m�dulo uart configurado -
 * UART_transmitData(uint32_t moduleInstance, uint_fast8_t transmitData) - Transmite um byte pelo m�dulo uart -
 * UART_receiveData(uint32_t moduleInstance) - Recebe um byte do m�dulo uart selecionado - ;
 * UART_queryStatusFlags(uint32_t moduleInstance, uint_fast8_t mask) - Ler o estado atual da flag selecionada do m�dulo - ;
 * UART_setDormant(uint32_t moduleInstance) - P�e o m�dulo em sleep mode, ( Only characters that are preceded by an idle-line or with address bit set UCRXIFG) - ;
 * UART_resetDormant(uint32_t moduleInstance) - Desabilita o sleep mode (Not dormant. All received characters set UCRXIFG) -
 * UART_transmitAddress(uint32_t moduleInstance, uint_fast8_t transmitAddress) - (Transmits the next byte to be transmitted marked as address depending on selected multiprocessor mode) -
 * UART_transmitBreak(uint32_t moduleInstance) - (Transmit break. Transmits a break with the next write to the transmit buffer) -
 * UART_getReceiveBufferAddressForDMA(uint32_t moduleInstance) - Retorna o endere�o do buffer rx do m�ulo DMA -
 * UART_getTransmitBufferAddressForDMA(uint32_t moduleInstance) - (Returns the address of the TX Buffer of the UART for the DMA module) -
 * UART_selectDeglitchTime(uint32_t moduleInstance, uint32_t deglitchTime) - (Sets the deglitch time, 2,50,100 ou 200ns) -
 * UART_enableInterrupt(uint32_t moduleInstance, uint_fast8_t mask) - Habilita a interrup��o da UART para a mascara escolhida -
 * UART_disableInterrupt(uint32_t moduleInstance, uint_fast8_t mask) - Desabilita a interrup��o da UART para a mascara escolhida - ;
 * UART_getInterruptStatus(uint32_t moduleInstance, uint8_t mask) - Pega o estado de interrup��o da flag escolhida - ;
 * UART_getEnabledInterruptStatus(uint32_t moduleInstance) - (Gets the current UART interrupt status masked with the enabled interrupts) - ;
 * UART_clearInterruptFlag - Limpa a flag selecionda -
 * UART_registerInterrupt UART_registerInterrupt(uint32_t moduleInstance, void (*intHandler)(void)) - Direciona a interrup��o para a rotina escolhida -
 * UART_unregisterInterrupt(uint32_t moduleInstance) - (Unregisters the interrupt handler for the UART module)
 **/
/*
 *************************"systick.h"*****************************************
 * SysTick_enableModule(void) - Habilita e inicia a contagem do m�dulo
 * SysTick_disableModule(void) - Para a contagem do m�dulo
 * SysTick_registerInterrupt(void (*intHandler)(void)) - Aponta para a rotina de interrup��o
 * SysTick_unregisterInterrupt(void) - "Desaponta" a rotina de interrup��o do m�dulo
 * SysTick_enableInterrupt(void) - Habilita a interrup��o de estouro da contagem
 * SysTick_disableInterrupt(void) - Desabilita a interrup��o de estouro da contagem
 * SysTick_setPeriod(uint32_t period) - Configura o n�mero de ticks m�ximo que come�a a contagem
 * SysTick_getPeriod(void) - Retorna o valor do tick de in�cio de contagem programado
 * SysTick_getValue(void) - Retonana o valor da contagem
 * lembrando que � contagem decrescente em que o m�ximo � o valor do periodo
 * SysTick->VAL = 0 - Para reiniciar a contagem de fato � preciso zerar esse registrador
 **/
/*
 *************************"timer32.h"*****************************************
 * Timer32_initModule - instancia(0,1); prescaler(1,15,256);ativa resolu��o e modo de opera��o
 * Timer32_setCount(uint32_t timer, uint32_t count) - se no modo peri�dico ele muda o periodo se no free run
 * ( Sets the count of the timer and resets the current value to the value passed. This value is set on the next rising edge of the clock provided to the timer module)
 * Timer32_setCountInBackground - seta o valor do current valor sem resetar
 * Timer32_getValue - (Timer32_getValue)
 * Timer32_startTimer - dar in�cio ao timer pre configurado
 * Timer32_haltTimer - Para a contagem preservando os par�metros
 * Timer32_enableInterrupt - Habilita a interrup��o do Timer
 * Timer32_disableInterrupt - desabilita a interrup��o do timer
 * Timer32_clearInterruptFlag - Limpa a flag de interrup��o do timer
 * Timer32_getInterruptStatus - pega o status da interrup��o do timer
 * Timer32_registerInterrupt - Registra uma chamada de interrup��o para o timer selecionado
 * Timer32_unregisterInterrupt - "Desregistra" a chamada de interrup��o para o timer selecionado
 */
/*
 **************************"cs.h"*********************************************************
 * CS_setExternalClockSourceFrequency - Seta a frequencia para o uso de cristais externos do LFXT e HFXT
 * CS_initClockSignal - Inicializa os clocks do sistema, escolhendo prescalers e osciladores
 * CS_startHFXT - Inicializa o HFXT oscilador previamente configurado com a frequ�ncia dita
 * CS_startHFXTWithTimeout - This function has a timeout associated with stabilizing the oscillator.
 * CS_startLFXT - Inicializa o LFXT oscilador previamente configurado com a frequ�ncia dita
 * CS_startLFXTWithTimeout - This function has a timeout associated with stabilizing the oscillator.
 * CS_setReferenceOscillatorFrequency - Seta a frequ�ncia do oscilador interno [REFO] em 32kHz ou 128kHz
 * CS_enableClockRequest - Habilita a requisi��o condicional para uso dos clocks[MCLK,ACLK,HSMCLK,SMCLK]
 * CS_disableClockRequest - Desabilita a requisi��o condicional para uso dos clocks[MCLK,ACLK,HSMCLK,SMCLK]
 * CS_getACLK - Get the current ACLK frequency.
 * CS_getSMCLK - Get the current SMCLK frequency.
 * CS_getMCLK - Get the current MCLK frequency.
 * CS_getBCLK - Get the current BCLK frequency.
 * CS_getHSMCLK - Get the current HSMCLK frequency.
 * CS_setDCOCenteredFrequency - Sets the centered frequency of DCO operation. Each frequency represents
 the centred frequency of a particular frequency range. Further tuning can be achieved by using the CS_tuneDCOFrequency function.
 * CS_setDCOFrequency - Automatically sets/tunes the DCO to the given frequency.
 * CS_tuneDCOFrequency - Tunes the DCO to a specific frequency.
 * CS_enableDCOExternalResistor -  Enables the external resistor for DCO operation
 * CS_disableDCOExternalResistor -  Disables the external resistor for DCO operation
 * CS_setDCOExternalResistorCalibration - ets the calibration value for the DCO when using the external resistor
 * CS_getDCOFrequency -  Gets the current tuned DCO frequency.
 * CS_enableFaultCounter - Enables the fault counter for the CS module. [HFXT , LFXT]
 * CS_disableFaultCounter -  Disables the fault counter for the CS module. [HFXT , LFXT]
 * CS_resetFaultCounter -  Resets the fault counter for the CS module. [HFXT , LFXT]
 * CS_startFaultCounter - Sets the count for the start value of the fault counter.
 * CS_enableInterrupt - Enables individual clock control interrupt sources.[HFXT, LFXT, DCO]
 * CS_disableInterrupt - Disables individual clock control interrupt sources.[HFXT, LFXT, DCO]
 * CS_getEnabledInterruptStatus - Gets the current interrupt status masked with the enabled interrupts.
 * CS_getInterruptStatus -  Gets the current interrupt status.
 * CS_clearInterruptFlag - Clears clock system interrupt sources.
 * CS_registerInterrupt - Registers an interrupt handler for the clock system interrupt.
 * CS_unregisterInterrupt - Unregisters the interrupt handler for the clock system.
 **/
/*
 **************************timer_a.h*************************************************
 * Timer_A_startCounter - Inicializa o contador, e o modo de opera��o.
 * Timer_A_configureContinuousMode - (em modo cont�nuo) Configura a fonte de clk, interrup��o, prescaler.
 * Timer_A_configureUpMode -  (em modo rampa) Configura a fonte de clk, interrup��o, prescaler.
 * Timer_A_configureUpDownMode - (em modo triangular) Configura a fonte de clk, interrup��o, prescaler.
 * Timer_A_initCapture - (em modo capture) Configura a fonte de clk, interrup��o, prescaler.
 * Timer_A_initCompare - (em modo compare) Configura a fonte de clk, interrup��o, prescaler.
 * Timer_A_clearTimer - Reset/Clear the timer clock divider, direction e count
 * Timer_A_getSynchronizedCaptureCompareInput - Get synchronized capture compare input
 * Timer_A_getOutputForOutputModeOutBitValue - Get output bit for output mode
 * Timer_A_getCaptureCompareCount - Get current capture compare count
 * Timer_A_setOutputForOutputModeOutBitValue - Set ouput bit for output mode
 * Timer_A_generatePWM - Configura o pwm -
 * Timer_A_stopTimer - Stops the timer
 * Timer_A_setCompareValue - Sets the value of the capture-compare register
 * Timer_A_getCounterValue - Returns the current value of the specified timer.
 * Timer_A_clearInterruptFlag - Clears the Timer TAIFG interrupt flag
 * Timer_A_clearCaptureCompareInterrupt - Clears the capture-compare interrupt flag
 * Timer_A_enableInterrupt - Enable timer interrupt
 * Timer_A_disableInterrupt - Disable timer interrupt
 * Timer_A_getInterruptStatus - Get timer interrupt status
 * Timer_A_getEnabledInterruptStatus - Get timer interrupt status masked with the enabled interrupts.
 * Timer_A_enableCaptureCompareInterrupt - Enable capture compare interrupt
 * Timer_A_disableCaptureCompareInterrupt - Disable capture compare interrupt
 * Timer_A_getCaptureCompareInterruptStatus - Return capture compare interrupt status
 * Timer_A_getCaptureCompareEnabledInterruptStatus - Return capture compare interrupt status masked with the enabled interrupts.
 * Timer_A_registerInterrupt - Registers an interrupt handler for the timer capture compare interrupt.
 * Timer_A_unregisterInterrupt - Unregisters the interrupt handler for the timer
 *
 *********************************** "i2c.h" *************************************************************************
 * I2C_enableModule - Enables the I2C block
 * I2C_enableMultiMasterMode - Enables Multi Master Mode
 * I2C_disableMultiMasterMode - Disables Multi Master Mode
 * I2C_setSlaveAddress - Sets the address that the I2C Master will place on the bus.
 * I2C_setMode - Sets the mode of the I2C device [EUSCI_B_I2C_TRANSMIT_MODE,EUSCI_B_I2C_RECEIVE_MODE]
 * I2C_initMaster - Initializes the I2C Master block and configure [clk source, data rate, CounterThreshold, autoSTOPGeneration]

 * I2C_disableModule - Disables the I2C block.
 * I2C_getMode - Gets the mode of the I2C device return[0(receive mode),1?(transimit mode )]
 * I2C_isBusBusy - Indicates whether or not the I2C bus is busy return [0(EUSCI_B_I2C_BUS_NOT_BUSY),1(EUSCI_B_I2C_BUS_BUSY]
 * I2C_masterIsStopSent - indica se o stop foi enviado
 * I2C_masterIsStartSent - indica de o start foi enviado \return Returns true if the START has been sent, false if it is sending

 * I2C_masterSendStart - This function is used by the Master module to initiate START
 * I2C_masterSendSingleByte - Does single byte transmission from Master to Slave [Sends START, Transmits the byte to the Slave, Sends STOP] \b UCBxIE, \b UCBxCTL1, \b UCBxIFG, \b UCBxTXBUF,
 * I2C_masterSendMultiByteStart - Starts multi-byte transmission from Master to Slave
 * I2C_masterSendMultiByteNext - Continues multi-byte transmission from Master to Slave
 * I2C_masterSendMultiByteFinish - Finishes multi-byte transmission from Master to Slave This function Transmits the last data byte of a multi-byte transmission to the Slave and Sends STOP
 * I2C_masterSendMultiByteStop - Send STOP byte at the end of a multi-byte transmission from Master to Slave

 * I2C_masterReceiveStart -  Starts reception at the Master end This function is used by the Master module initiate reception of a single byte. This function Sends START
 * I2C_masterReceiveSingleByte - Does single byte reception from the slave This function is used by the Master module to receive a single byte. This function: Sends START and STOP Waits for data reception Receives one byte from the Slave
 * I2C_masterReceiveSingle - Receives a byte that has been sent to the I2C Master Module. This function reads a byte of data from the I2C receive data Register.
 * I2C_masterReceiveMultiByteNext - Starts multi-byte reception at the Master end one byte at a time This function is used by the Master module to receive each byte of a multi-byte reception This function reads currently received byte
 * I2C_masterReceiveMultiByteFinish - Finishes multi-byte reception at the Master end - Receives the current byte and initiates the STOP from Master to Slave
 * I2C_masterReceiveMultiByteStop - Sends the STOP at the end of a multi-byte reception at the Master end - This function is used by the Master module to initiate STOP

